Revit 2024 API
DockableFrameFocusChangedEventArgs.FocusGained Property
 True if the pane is being activated, false if it is being inactivated.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public bool FocusGained { get; }
Visual Basic
Public ReadOnly Property FocusGained As Boolean
	Get
Visual C++
public:
property bool FocusGained {
	bool get ();
}
See Also
DockableFrameFocusChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace